# Дано
start_list = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
# Нужно ->>> ['в', '"', '05', '"', 'часов', '"', '17', '"', 'минут', 'температура', 'воздуха', 'была', '"', '+05', '"', 'градусов']

new_list = []
for i in start_list:
    if i[0] in ["+", "-"]:
        if i[1].isdigit():
            new_i = f'{i[0]}{int(i[1:]):02d}'
            new_list.extend(['"', new_i, '"'])
    elif i.isdigit():
        new_i = f'{int(i):02d}'
        new_list.extend(['"', new_i, '"'])
    else:
        new_list.append(i)

print(new_list)                                         # ['в', '"', '05', '"', 'часов', '"', '17', '"', 'минут', 'температура', 'воздуха', 'была', '"', '+05', '"', 'градусов']


# Из ОБРАБОТАННОГО списка нужно сформировать строку ->>> в "05" часов "17" минут температура воздуха была "+05" градусов
new_string = ''
for i in new_list:
    new_string += ' ' + i
print(new_string)                                       # в " 05 " часов " 17 " минут температура воздуха была " +05 " градусов

new_string_2 = ' '.join(new_list)
print(new_string_2)

# in place
print(start_list)                                     # ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
x = 0
for i in start_list:
    if i[0] in ["+", "-"]:
        start_list[x] = f'"{i[0]}{int(i[1:]):02d}"'
    elif i.isdigit():
        start_list[x] = f'"{int(i):02d}"'
    else:
        start_list[x] = i
    x += 1

print("In place")
print(start_list)                                   # ['в', '"05"', 'часов', '"17"', 'минут', 'температура', 'воздуха', 'была', '"+05"', 'градусов']